Revit 2025 API
AnalyticalSurfaceBase.SetOuterContour Method
 Sets the Curve Loop that defines the geometry of the Analytical Surface element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetOuterContour(
	CurveLoop outerContour
)
Public Sub SetOuterContour (
	outerContour As CurveLoop
)
public:
void SetOuterContour(
	CurveLoop^ outerContour
)
member SetOuterContour :
        outerContour : CurveLoop -> unit
Parameters
outerContour CurveLoop
 New Curve Loop for the Analytical Surface element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Curve Loop must be planar and not self-intersecting.
Example
   using (Transaction transaction = new Transaction(document, "Edit Analytical Panel outer contour"))
   {
      transaction.Start();
      //create a new curve loop
      CurveLoop profileloop = new CurveLoop();
      profileloop.Append(Line.CreateBound(
         new XYZ(0, 0, 0), new XYZ(5, 0, 0)));
      profileloop.Append(Line.CreateBound(
         new XYZ(5, 0, 0), new XYZ(5, 5, 0)));
      profileloop.Append(Line.CreateBound(
         new XYZ(5, 5, 0), new XYZ(-2, 5, 0)));
      profileloop.Append(Line.CreateBound(
         new XYZ(-2, 5, 0), new XYZ(0, 0, 0)));
      //Sets the new contour for analytical panel
      analyticalPanel.SetOuterContour(profileloop);
      transaction.Commit();
   }
}
    Using transaction As Transaction = New Transaction(document, "Edit Analytical Panel outer contour")
        transaction.Start()
        'create a new curve loop
        Dim profileloop As CurveLoop = New CurveLoop()
        profileloop.Append(Line.CreateBound(New XYZ(0, 0, 0), New XYZ(5, 0, 0)))
        profileloop.Append(Line.CreateBound(New XYZ(5, 0, 0), New XYZ(5, 5, 0)))
        profileloop.Append(Line.CreateBound(New XYZ(5, 5, 0), New XYZ(-2, 5, 0)))
        profileloop.Append(Line.CreateBound(New XYZ(-2, 5, 0), New XYZ(0, 0, 0)))
        'Sets the new contour for analytical panel
        analyticalPanel.SetOuterContour(profileloop)
        transaction.Commit()
    End Using
End If
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
    Using transaction As Transaction = New Transaction(document, "Edit Analytical Panel outer contour")
        transaction.Start()
        'create a new curve loop
        Dim profileloop As CurveLoop = New CurveLoop()
        profileloop.Append(Line.CreateBound(New XYZ(0, 0, 0), New XYZ(5, 0, 0)))
        profileloop.Append(Line.CreateBound(New XYZ(5, 0, 0), New XYZ(5, 5, 0)))
        profileloop.Append(Line.CreateBound(New XYZ(5, 5, 0), New XYZ(-2, 5, 0)))
        profileloop.Append(Line.CreateBound(New XYZ(-2, 5, 0), New XYZ(0, 0, 0)))
        'Sets the new contour for analytical panel
        analyticalPanel.SetOuterContour(profileloop)
        transaction.Commit()
    End Using
End If
See Also
Reference
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace